{
  "references": [
    {
      "id": 1,
      "text": "At last your two-day hike is over. You unsheathe your sword, lay it on the ground and sigh with relief as you lower yourself down on to the mossy rocks to sit for a moment's rest. You stretch, rub your eyes and finally look up at Firetop Mountain. The very mountain itself looks menacing. The steep face in front of you looks to have been savaged by the claws of some gargantuan beast. Sharp rocky crags jut out at unnatural angles. At the top of the mountain you can see the eerie red colouring - probably some strange vegetation - which has given the mountain its name. Perhaps no one will ever know exactly what grows up there, as climbing the peak must surely be impossible. Your quest lies ahead of you. Across the clearing is a dark cave entrance. You pick up your sword, get to your feet and consider what dangers may lie ahead of you. But with determination, you thrust the sword home into its scabbard and approach the cave. You peer into the gloom to see dark, slimy walls with pools of water on the stone floor in front of you. The air is cold and dank. You light your lantern and step warily into the blackness. Cobwebs brush your face and you hear the scurrying of tiny feet: rats, most likely. You set off into the cave. After a few yards you arrive at a junction. Will you turn west (turn to 71) or east (turn to 278)?",
      "references": [
        {
          "description": "Turn west.",
          "reference": 71
        },
        {
          "description": "Turn east.",
          "reference": 278
        }
      ]
    },
    {
      "id": 71,
      "text": "There is a right-hand turn to the north in the passage. Cautiously you approach a sentry post on the corner and, as you look in, you can see a strange Goblin-like creature in leather armour asleep at his post. You try to tiptoe past him. Test your Luck. If you are Lucky, he does not wake up and remains snoring loudly - turn to 301. If you are Unlucky, you step with crunch on some loose ground and his eyes flick open - turn to 248.",
      "references": [
        {
          "description": "Lucky.",
          "reference": 301
        },
        {
          "description": "Unlucky.",
          "reference": 248
        }
      ]
    },
    {
      "id": 92,
      "text": "You arrive back at the junction in the passage. You look left to see the cave entrance in the dim distance but walk straight on. Turn to 71.",
      "references": [
        {
          "description": "Walk straight on.",
          "reference": 71
        }
      ]
    },
    {
      "id": 156,
      "text": "You charge the door with your shoulder. Roll two dice. If the number rolled is less than or equal to your SKILL score, you succeed - turn to 343. If the number rolled is greater than your SKILL, you rub your bruised shoulder and decided against trying again. Turn to 92 to return to the junction.",
      "references": [
        {
          "description": "Succeed on charging the door.",
          "reference": 343
        },
        {
          "description": "Failed to open the door. Return to the junction.",
          "reference": 92
        }
      ]
    },
    {
      "id": 248,
      "text": "The creature that has just awakened is an ORC! He scrambles to his feet and turns to gasp at a rope which is probably the alarm bell. You must attack him quickly. If you defeat him, you may continue up the passage - turn to 301.",
      "references": [
        {
          "description": "Defeated ORC.",
          "reference": 301
        }
      ],
      "battle": {
        "enemies": [
          {
            "name": "ORC",
            "skill": 6,
            "stamina": 5
          }
        ]
      }
    },
    {
      "id": 278,
      "text": "The passageway soon comes to an end at a locked wooden door. You listen at the door but hear nothing. Will you try to charge the door down? If so, turn to 156. If you would rather turn round and go back to the junction, turn to 92.",
      "references": [
        {
          "description": "Charge the door.",
          "reference": 156
        },
        {
          "description": "Go back to the junction.",
          "reference": 92
        }
      ]
    },
    {
      "id": 301,
      "text": "To your left, on the west face of the passage, there is a rough-cut wooden door. You listen at the door and can hear a rasping sound which may be some sort of creature snoring. Do you want to open the door? If so, turn to 82. If you wish to press on northwards, turn to 208.",
      "references": [
        {
          "description": "Game over.",
          "reference": -1
        }
      ]
    },
    {
      "id": 343,
      "text": "The door burst open and you fall headlong into a room. But your heart jumps as you realize you are not landing on the floor, but plunging down a pit of some kind! Luckily the pit is not particularly deep and you land in a heap less than two metres down. Lose 1 STAMINA point for your bruises, climb out of the pit into the room and leave through the door heading westwards. Turn to 92.",
      "references": [
        {
          "description": "Return to the junction.",
          "reference": 92
        }
      ],
      "effects": {
        "stamina": -1
      }
    }
  ]
}